Tekla Open API Reference for Tekla Structures 2025
AnalysisModel.AnalysisModelSpectrumProperties Property
 Gets or sets the analysis model spectrum properties
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisModelSpectrumProperties AnalysisModelSpectrumProperties { get; set; }
Public Property AnalysisModelSpectrumProperties As AnalysisModelSpectrumProperties
	Get
	Set
Property Value
Type: AnalysisModelSpectrumProperties
See Also
Reference
AnalysisModel Class
Tekla.Structures.Analysis Namespace